


SET NAMES UTF8;
DROP DATABASE IF EXISTS qdm114540346_db;
CREATE DATABASE qdm114540346_db CHARSET=UTF8;
USE qdm114540346_db;

CREATE TABLE mg_user(
 uid INT PRIMARY KEY AUTO_INCREMENT,
  
 uname VARCHAR(32),
  upwd VARCHAR(32),
  email VARCHAR(64),
  phone VARCHAR(16)
 
);

INSERT INTO mg_user values(null,'liuhao','0000','liu@.163.com','13882087409'),
(null,'diudiu','12345','diu@qq.com','13232087409'),
(null,'tom','sas','tom@12.com','18981754692'),
(null,'arick','1111','leadcorder@163.com','13982086409');
 CREATE TABLE mg_product(
	lid INT PRIMARY KEY AUTO_INCREMENT,
	img  VARCHAR(128),
 	title VARCHAR(128),         #主标题
  	price DECIMAL(10,2)       #价格
);
insert into mg_product values(
	null,"img/10605349_606091763758813.jpg", "深圳大梅沙莎翁双周13天戏剧独立营 3日游",11880),
	(null,"img/10605584_968547999281369.jpg","银川+明长城+腾格里沙漠+西部影视城5天4夜3日游",3980),
	(null,"img/10590416_792198929410795.jpg","  【海洋精灵】三亚3日游  ",3980),
	(null,"img/10605848_899872249291908.jpg","冷暖水上欢乐世界g东莞樟木头3日游自由行",2699),
	(null,"img/10606014_881996657571653.jpg","境外游【境外游两人立减600元/单】美国西海岸+旧金山+洛杉矶拉斯维...  ",6799),
	(null,"img/10606026_070079481327342.jpg","  境外游【两人立减1000元/单】拉斯维美功铁道市场半日游美国西海岸+旧金山+洛杉矶+拉...  ",3980),
	(null,"img/10605349_606091763758813.jpg","   境外游【深度纯玩】澳大利亚东海岸全景+大堡礁10日纯玩之旅  ",10699),
	(null,"img/10606268_816771151439027.jpg","   境外游  枫花渡月:日本东京+京都+大阪6日5晚跟团游   ",4780),
	(null,"img/10606292_787135573291265.jpg","  境外游 北欧四国芬兰+瑞典+挪威+丹麦+双峡湾11日跟团游  ",25850),
	(null,"img/dongguan1.jpg"," 三正半山酒店美食双人套票/半山房一晚+自助早餐+池畔双人自助晚餐+恒温泳池+湿蒸健身3日游",3230),
	(null,"img/dongguan.jpg"," 入住五星级东莞帝豪花园酒店+双人梦幻百花洲日场门票+豪华自助早&晚餐+逾200款美食+爽啤畅饮3日游",2500),
	(null,"img/en.png"," 龙门铁泉大温泉+冷暖水上欢乐世界+早餐 惠州龙门南昆山3日游自由行",1580),
	(null,"img/buyu.jpg"," 入住五星级东莞帝豪花园酒店+双人梦幻百花洲日场门票+豪华自助早&晚餐+逾200款美食+爽啤畅饮 惠州龙门南昆山3日游自由行",2980),
	(null,"img/huizhou.jpg"," 东莞大朗2-5日自由行五星级东莞帝豪花园酒店精选美食套票/入住园景房+豪华早餐及晚餐+饮料券+逾200款顶级海鲜美食任食+爽啤畅饮！ 惠州龙门南昆山3日游日自由行",7980),
	(null,"img/fum.png"," 河源御临门2-5日自由行河源御临门温泉度假村+自助早餐+温泉门票 东莞樟木头2-5日自由行",380),
	(null,"img/asd.jpg"," 惠东巽寮湾2-5日自由行金海湾嘉华度假酒店+双人自助早餐+双人山谷温泉门票，海天一色的悠然，全新五星标准度假酒店，奢华逸韵之旅！ 东莞樟木头3日游自由行",18880),
	(null,"img/ss.jpg","  <深圳东部华侨城两日自驾游>房车酒店套票+双早+大侠谷茶溪谷两日游套票 东莞樟木头3日游自由行",3980),
	(null,"img/pg2.jpeg"," 深圳东部华侨城两日自驾游 东莞樟木头3日游自由行",480),
	(null,"img/ws.jpg","  境外游巴黎热气球空中之旅/一晚特色农庄酒店/蜜月小镇-琉森/罗浮宫/枫丹白露宫 3日游",1333),
	(null,"img/zhonglou.jpg","  西欧名城全景游/艺术宝库卢浮宫/湖边小镇琉森/文艺复兴之城佛罗伦萨/风车王国荷兰 3日游",19559),
	(null,"img/ll.jpg"," 深圳往返/当地4-5星酒店/3晚温泉酒店/米其林评鉴三星景点及世界遗产 【白川乡合掌村】/岚山嵯峨野壮...3日游 ",25370),
	(null,"img/ta.jpg"," 境外游日本本州大阪+奈良+白川乡+轻井泽红叶三温泉6日跟团游",3456),
	(null,"img/as.jpeg"," 境外游日本本州大阪+奈良+白川乡+轻井泽红叶三温泉6日跟团游",6980),
	(null,"img/e174ea33-374e-4863-af49-e03bfbee4a64.jpg"," 西欧名城全景游/艺术宝库卢浮宫/湖边小镇琉森/文艺复兴之城佛罗伦萨/风车王国荷兰",6980),
	(null,"img/ts.jpg"," 巴黎热气球空中之旅/一晚特色农庄酒店/蜜月小镇-琉森/罗浮宫/枫丹白露宫",9980),
	(null,"img/10590416_792198929410795.jpg"," 欧洲法国+瑞士+意大利10日跟团游",10080),
	(null,"img/ws.jpg"," 境外游法国+意大利+瑞士+梵蒂冈+奥地利+德国+卢森堡+列支敦士登+比利时+荷兰14日跟团游",4567),
	(null,"img/d8794c07-0fa0-4f00-a294-bf72e9aae739.jpg"," 深起港止/免费车载wifi/五大世界文化遗产+加利利湖+萨法德小镇3日游",6980),
	(null,"img/fs.jpg"," 境外游以色列8日跟团游+轻井泽红叶三温泉6日跟团游",1480),
	(null,"img/fss.jpg"," 以色列8日跟团游",6970),
	(null,"img/do.jpg"," 惠州龙门南昆山3日游自由行龙门铁泉大温泉+冷暖水上欢乐世界+早餐",690),
	(null,"img/10605349_606091763758813.jpg","境外游 日本本州大阪+奈良+白川乡+轻井泽红叶三温泉6日跟团游",450),
	(null,"img/10606292_787135573291265.jpg"," 境外游日本本州大阪+奈良+白川乡+轻井泽红叶三温泉6日跟团游",1280),
	(null,"img/osaka256-256.jpg"," 境外游捷克布拉格13日自由行·往返含税机票+送最后一晚酒店 可配全国联运  签证保险玩乐一站购",6230),
	(null,"img/tokyo256-256.jpg"," 境外游白川乡+轻井泽红叶三温泉6日跟团游",4580),
	(null,"img/zhonglou.jpg","境外游 日本本州大阪+奈良+白川乡+轻井泽红叶三温泉6日跟团游",2380),
	(null,"img/94c4f3f45f0c8502.jpg_r_390x260x90_7620ba11.jpg"," 中国国旅、海口-三亚2日*临海游*南山寺+南海观音、天涯海角、亚龙湾",3400),
	(null,"img/c2da123d4bb12ee593835fbb.jpg_256x160_3755801b.jpg"," 境外游捷克布拉格13日自由行·往返含税机票+送最后一晚酒店 可配全国联运  签证保险玩乐一站购",6123),
	(null,"img/8db08d342fdbb13c93835fbb.jpg_256x160_96f65102.jpg"," 成都-布拉格往返机票特价，携程自由行专享特惠！",6980),
	(null,"img/49e90d4632edbd7d93835fbb.jpg_256x160_50bfc2a3.jpg","境外游 柬埔寨暹粒吴哥窟6日5晚自由行·『成都直飞』+白班机+泳池Spa+Hign翻天+寒假春节开售3日游",6980),
	(null,"img/u=382394777,2527632309&fm=27&gp=0.jpg","境外游日本本州大阪+奈良+白川乡+轻井泽红叶三温泉6日跟团游",6980),
	(null,"img/osaka256-256 (1).jpg"," 境外游捷克布拉格13日自由行·往返含税机票+送最后一晚酒店 可配全国联运  签证保险玩乐一站购3日游",2380),
	(null,"img/zd0g0c000000650nk8A26_C_570_285.jpg"," 境外游沙巴Kawa红树林一日游【五星餐饮+清真寺+萤火虫+长鼻猴+1元接送机】3日游",6340),
	(null,"img/u=1138425554,2996907717&fm=77&w_h=121_75&cs=2160343221,3011666.jpg","境外游 泰国曼谷丹嫩沙多水上集市+美功铁道市场半日游【限量促销/中文导游/可选骑大象】3日游",3980),
	(null,"img/49e90d4632edbd7d93835fbb.jpg_256x160_50bfc2a3.jpg"," 境外游塞舌尔8日6晚自由行·单机票·惠购·成都直飞· 国内仅有的直飞航班·享1000元北上广三地联运3日游 ",6917),
	(null,"img/eeeb979f96244837.jpg"," 美功铁道市场半日游·享1000元北上广三地联运 3日游",8999),
	(null,"img/eeeb979f96244837.jpg"," 境外游洛杉矶拉斯维美功铁道市场半日游·享1000元北上广三地联运 ",25670);